PrzemyslawSwiderski/cyber-eye/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.3 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_APP_REPRODUCIBLE_BUILD=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_HTTPD_ENABLE_EVENTS=n
CONFIG_ESPP_FILE_SYSTEM_PARTITION_LABEL="storage"
CONFIG_ESP_BOARD_PERIPH_SPI_SUPPORT=y
CONFIG_GMF_IO_INIT_HTTP_WRITER=y
CONFIG_GMF_AUDIO_CODEC_DECODER_TYPE_MP3=y
CONFIG_GMF_AUDIO_CODEC_INIT_ENCODER=n
CONFIG_GMF_AUDIO_EFFECT_RATE_CVT_DEST_RATE=48000
CONFIG_GMF_AUDIO_EFFECT_RATE_CVT_PERF_TYPE_SPEED=y
CONFIG_GMF_AI_AUDIO_INIT_AEC=n
CONFIG_GMF_VIDEO_CODEC_INIT_ENCODER=y
CONFIG_GMF_VIDEO_ENC_CODEC_TYPE_HW_H264=y
CONFIG_GMF_VIDEO_ENC_CODEC_TYPE=0x48323634
CONFIG_GMF_VIDEO_EFFECTS_INIT_PPA=n
CONFIG_GMF_VIDEO_EFFECTS_INIT_FPS_CONVERT=n
CONFIG_GMF_VIDEO_EFFECTS_INIT_OVERLAY=n
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_I2C_ENABLE_DEBUG_LOG=y
CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_I2S_ENABLE_DEBUG_LOG=y
CONFIG_TEMP_SENSOR_ENABLE_DEBUG_LOG=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=65536
CONFIG_HTTPD_PURGE_BUF_LEN=512
CONFIG_HTTPD_SERVER_EVENT_POST_TIMEOUT=100
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_SPIRAM=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM=y
CONFIG_AUDIO_DECODER_G711_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_DECODER_FLAC_SUPPORT=n
CONFIG_AUDIO_DECODER_OPUS_SUPPORT=n
CONFIG_AUDIO_DECODER_VORBIS_SUPPORT=n
CONFIG_AUDIO_DECODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_DECODER_ALAC_SUPPORT=n
CONFIG_AUDIO_DECODER_PCM_SUPPORT=n
CONFIG_AUDIO_DECODER_SBC_SUPPORT=n
CONFIG_AUDIO_DECODER_LC3_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_WAV_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_M4A_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_TS_SUPPORT=n
CONFIG_AUDIO_ENCODER_G711_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_ENCODER_OPUS_SUPPORT=n
CONFIG_AUDIO_ENCODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_ALAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_PCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_SBC_SUPPORT=n
CONFIG_AUDIO_ENCODER_LC3_SUPPORT=n
CONFIG_CODEC_ES7210_SUPPORT=n
CONFIG_CODEC_ES7243_SUPPORT=n
CONFIG_CODEC_ES7243E_SUPPORT=n
CONFIG_CODEC_ES8156_SUPPORT=n
CONFIG_CODEC_AW88298_SUPPORT=n
CONFIG_CODEC_ES8389_SUPPORT=n
CONFIG_CODEC_ES8374_SUPPORT=n
CONFIG_CODEC_ES8388_SUPPORT=n
CONFIG_CODEC_TAS5805M_SUPPORT=n
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_VIDEO_DECODER_SW_H264_SUPPORT=n
CONFIG_VIDEO_DECODER_SW_MJPEG_SUPPORT=n
CONFIG_VIDEO_DECODER_HW_MJPEG_SUPPORT=n
CONFIG_VIDEO_ENCODER_SW_H264_SUPPORT=n
CONFIG_VIDEO_ENCODER_SW_MJPEG_SUPPORT=n
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Crucial for littlefs
CONFIG_VFS_MAX_COUNT=20

# Camera config
CONFIG_VIDEO_ENCODER_HW_H264_SUPPORT=y
CONFIG_VIDEO_ENCODER_HW_MJPEG_SUPPORT=n
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y

#CONFIG_CAMERA_OV5647_MIPI_RAW8_800X1280_50FPS=y
#CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X800_50FPS=n
#CONFIG_CAMERA_OV5647_MIPI_RAW10_1920X1080_30FPS=y
#CONFIG_CAMERA_OV5647_MIPI_RAW10_1280X960_BINNING_45FPS=y
CONFIG_CAMERA_OV5647_CUSTOMIZED_IPA_JSON_CONFIGURATION_FILE=n
#CONFIG_CAMERA_OV5647_CUSTOMIZED_IPA_JSON_CONFIGURATION_FILE_PATH="OV5647_config.json"
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y
CONFIG_VIDEO_ENCODER_HW_H264_SUPPORT=y

#
# Cyber EYE
#
# 800X640_50FPS
#CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
#CONFIG_VIDEO_STREAM_WIDTH=800
#CONFIG_VIDEO_STREAM_HEIGHT=640
#CONFIG_VIDEO_STREAM_FPS=50
# 1280X960_BINNING_45FPS
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW10_1280X960_BINNING_45FPS=y
CONFIG_CAMERA_OV5647_MIPI_RAW10_1280X960_BINNING_45FPS=y
CONFIG_VIDEO_STREAM_WIDTH=1280
CONFIG_VIDEO_STREAM_HEIGHT=960
CONFIG_VIDEO_STREAM_FPS=45
# 1920X1080_30FPS
#CONFIG_CAMERA_OV5647_MIPI_RAW10_1920X1080_30FPS=y
#CONFIG_VIDEO_STREAM_WIDTH=1920
#CONFIG_VIDEO_STREAM_HEIGHT=1080
#CONFIG_VIDEO_STREAM_FPS=30
# end of Cyber EYE

# Video performance optimization
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Overclocking not working with chip 1.0 (panic :( )
#CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
#CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=400

# Cache Config
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_SIZE=0x40000
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_CACHE_L2_CACHE_LINE_SIZE=128
CONFIG_CACHE_L1_CACHE_LINE_SIZE=64


CONFIG_LWIP_TCPIP_TASK_PRIO=15
CONFIG_LWIP_IP_REASS_MAX_PBUFS=100
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8192
#CONFIG_LWIP_TCPIP_TASK_AFFINITY=0x0
#CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_LWIP_TCPIP_TASK_AFFINITY=0x1
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y
CONFIG_TCP_SND_BUF_DEFAULT=32768
CONFIG_TCP_WND_DEFAULT=65535
CONFIG_TCPIP_TASK_STACK_SIZE=8192
#CONFIG_TCPIP_TASK_AFFINITY_CPU0=y
#CONFIG_TCPIP_TASK_AFFINITY=0x0
CONFIG_TCPIP_TASK_AFFINITY_CPU1=y
CONFIG_TCPIP_TASK_AFFINITY=0x1
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_EXTRA_IRAM_OPTIMIZATION=y

#
# DW_GDMA Configurations
#
CONFIG_DW_GDMA_CTRL_FUNC_IN_IRAM=y
CONFIG_DW_GDMA_SETTER_FUNC_IN_IRAM=y
CONFIG_DW_GDMA_GETTER_FUNC_IN_IRAM=y
CONFIG_DW_GDMA_ISR_IRAM_SAFE=y
CONFIG_DW_GDMA_OBJ_DRAM_SAFE=y

#
# ESP-Driver:Camera Controller Configurations
#
CONFIG_CAM_CTLR_MIPI_CSI_ISR_CACHE_SAFE=y
CONFIG_CAM_CTLR_ISP_DVP_ISR_CACHE_SAFE=y
CONFIG_CAM_CTLR_DVP_CAM_ISR_CACHE_SAFE=y


#
# ESP PSRAM
#
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_SPEED=200
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_PRE_CONFIGURE_MEMORY_PROTECTION=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# end of PSRAM config


#
# Chip revision
#
#
# NOTE! Support of ESP32-P4 rev. <3.0 and >=3.0 is mutually exclusive
#
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_ESP_REV_MIN_FULL=100

#
# Maximum Supported ESP32-P4 Revision (Rev v1.99)
#
CONFIG_ESP32P4_REV_MAX_FULL=199
CONFIG_ESP_REV_MAX_FULL=199
CONFIG_ESP_EFUSE_BLOCK_REV_MIN_FULL=0
CONFIG_ESP_EFUSE_BLOCK_REV_MAX_FULL=199


### sdkconfig for ESP32-P4 + C6 as co-processor https://github.com/espressif/esp-hosted-mcu/blob/main/docs/performance_optimization.md

# Let P4 know, C6 is attached as slave
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y

# Wi-Fi Performance
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# TCP/IP Performance
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y
CONFIG_ESP_SDIO_TX_Q_SIZE=10
CONFIG_ESP_SDIO_RX_Q_SIZE=10

# Transport Optimization
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=50000
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SPI_CLK_FREQ=40

# Memory Optimization

## Reduce queue sizes
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=10 
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=10 

## Enable memory pooling
CONFIG_ESP_HOSTED_USE_MEMPOOL=y
